# 1.Напишите программу, которая принимает на вход координаты двух точек и
#   находит расстояние между ними в 2D пространстве.
#   Пример:
#   - A (3,6); B (2,1) -> 5,09
#   - A (7,-5); B (1,-1) -> 7,21
# AB = √(xb - xa)2 + (yb - ya)2

from math import sqrt # Я незнаю перых трёх слов в этой стороке. Но мне нужно было корень извлеч.

print('Введите координаты двух точек чтобы узнать расстояние между ними.')

x1 = int(input('Введите х1: '))
y1 = int(input('Введите y1: '))

x2 = int(input('Введите х2: '))
y2 = int(input('Введите y2: '))

xy = (x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1)

print(type(sqrt(xy)))