# 1.Напишите программу, которая принимает на вход цифру, 
#   обозначающую день недели, и проверяет, является ли этот день выходным.
#   Пример:
#   - 6 -> да
#   - 7 -> да
#   - 1 -> нет

day = int(input('Введите число от 1 до 7, чтобы узнать какой день обозначает цыфра: '))

list_day = ['Панидельник', 'Вторник', 'Среда', 'Четверг', 'Пятница', 'Суббота', 'Воскресенье']

if day < 6 and day > 0:
    print(f'{list_day[day - 1]} это рабочий день. =(')
elif day < 8 and day > 5:
    print(f'{list_day[day - 1]} это выходной день! =D')
    print('Как проведёшь выходной? ;)')
else:
    print('Увы и ах! Ты ввёл некоректный(е) символ(ы). Поэтому попробуй ещё раз, введи цыфру в диопозоне от 1 до 7.')