# 1.Напишите программу, которая принимает на вход координаты точки 
#   (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, 
#   в которой находится эта точка (или на какой оси она находится).
#   Пример:
#   - x=34; y=-30 -> 4
#   - x=2; y=4-> 1
#   - x=-34; y=-30 -> 3

print('Введи координаты точи х и у(невписывай 0), чтобы понять в какой плоскости находится точка.')
dotx = int(input('x: '))
doty = int(input('y: '))

if dotx != 0 and doty != 0:
    if dotx > 0 and doty > 0:
        print('Четверь №1.')
    elif dotx < 0 and doty > 0:
        print('Четверь №2.')
    elif dotx < 0 and doty < 0:
        print('Четверь №3.')
    else:
        print('Четверь №4.')
else:
    print('Я же тебе чёрным по белому написал, НЕВПИСЫВАЙ 0!')


