# 1.Напишите программу, которая по заданному номеру четверти, 
#   показывает диапазон возможных координат точек в этой четверти (x и y).

quarter = int(input('Введите цыфру от 1 до 4, что бы понять диапазон четверти.'))

if quarter == 1:
    print('x, y')
elif quarter == 2:
    print('-x, y')
elif quarter == 3:
    print('-x, -y')
elif quarter == 4:
    print('x, -y')
else:
    print('Некорректно ведены данные.')